Функция JSONВОбъект(СтрокаJSON) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат Данные;
КонецФункции 

Функция ПолучитьТекстJSON(ДанныеJSON) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON) Экспорт
	Соединение = Новый HTTPСоединение("192.168.1.106", , "Администратор");
	
	HTTPЗапросЗапрос = Новый HTTPЗапрос("Grooming/hs/users/createOrder");
	HTTPЗапросЗапрос.УстановитьТелоИзСтроки(СтруктураРеквизитовДокументаJSON, "UTF-8");
	
	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросЗапрос);
		Если Ответ.КодСостояния = 200 Тогда
			Возврат Истина; 
		Иначе
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
			Возврат Ложь; 
		КонецЕсли;
	Исключение
		Сообщить("Сетевое исключение: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь; 
	КонецПопытки;
КонецФункции

