
&НаСервере
Процедура УслугиУслугаПриИзмененииНаСервере(ИдентификаторСтроки)
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТЧ.Цена = СтрокаТЧ.Услуга.Стоимость;
	ЭтаФорма.Стоимость = Объект.Услуги.Итог("Цена");
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	Строка = Элементы.Услуги.ТекущиеДанные;
	УслугиУслугаПриИзмененииНаСервере(Строка.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Функция ЗаписатьсяНаСервере()
	
	СтруктураРеквизитовДокумента = Новый Структура;
	СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
	СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
	
	СтруктураРеквизитовДокумента.Вставить("GUIDПользователя", ПараметрыСеанса.ТекущийПользователь.ВнешнийGUID);
	
	МассивУслуг = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		УслугаСтруктура = Новый Структура;
		УслугаСтруктура.Вставить("Услуга", Строка(СтрокаТЧ.Услуга));
		УслугаСтруктура.Вставить("Стоимость", СтрокаТЧ.Цена);
		МассивУслуг.Добавить(УслугаСтруктура);
	КонецЦикла;
	
	СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);
	
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);
	
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	
	Если ДокументУспешноОтправлен Тогда
		ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
		
		ЗаписьКлиента.Дата = ТекущаяДата(); 
		ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
		
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			НоваяСтрока = ЗаписьКлиента.Услуги.Добавить();
			НоваяСтрока.Услуга    = СтрокаТЧ.Услуга;
			НоваяСтрока.Стоимость = СтрокаТЧ.Цена;
		КонецЦикла;
		
		Попытка
			ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьКлиента.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Вы успешно записаны! Запись сохранена.";
		СообщениеПользователю.Сообщить();
		
		Объект.ДатаЗаписи = '00010101';
		Объект.Сотрудник  = Справочники.Сотрудники.ПустаяСсылка();
		Объект.Услуги.Очистить();
		
		Возврат Истина;
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось отправить Запись на сервер!";
		СообщениеПользователю.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Записаться(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДатаЗаписи) И Объект.ДатаЗаписи < ТекущаяДата() Тогда
		ПоказатьПредупреждение(, "Пожалуйста, измените дату записи. Запись на прошедшее время невозможна.");
		Возврат;
	КонецЕсли;
	
	Успешно = ЗаписатьсяНаСервере();
	
	Если Успешно Тогда
		ОткрытьФорму("Документ.ЗаписьКлиента.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ЭтаФорма.Стоимость = Объект.Услуги.Итог("Цена");
	
КонецПроцедуры

