
Процедура ВыполнитьРегистрацию(Логин, Телефон) Экспорт
	
	Соединение = Новый HTTPСоединение("192.168.1.104", , "Администратор", "");
	
	ПутьЗапроса = "Grooming/hs/users/register?username=" + Логин + "&phone=" + Телефон;
	Запрос = Новый HTTPЗапрос(ПутьЗапроса);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеССервера = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		
		АвторизоватьПользователя(ДанныеССервера, Телефон);
	КонецЕсли;
	
КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеССервера, Телефон) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = ДанныеССервера.name;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	НовыйПользовательИБ.Записать();
	
	ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
	ОбъектПользователь.Наименование = ДанныеССервера.name;
	ОбъектПользователь.ВнешнийGUID = ДанныеССервера.code; 
	ОбъектПользователь.Телефон     = Телефон; 
	ОбъектПользователь.Записать();
	
	ПараметрыСеанса.ТекущийПользователь = ОбъектПользователь.Ссылка;
	
КонецПроцедуры


