Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользовательИБ.Имя);
	
	Если ТекущийПользователь.Пустая() Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.Код = Строка(ПользовательИБ.УникальныйИдентификатор);
		ПользовательОбъект.Наименование = ПользовательИБ.Имя;
		ПользовательОбъект.Записать();
		ТекущийПользователь = ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	
КонецПроцедуры
